(function() {
  'use strict';

  angular
    .module('client')
    .service('pattern', pattern);

  /** @ngInject */
  function pattern() {
    return {
      reg: {
        username: /^(13[0-9]|15[0|1|3|6|7|8|9]|18[8|9])\d{8}$|^(?:[\w\!\#\$\%\&\'\*\+\-\/\=\?\^\`\{\|\}\~]+\.)*[\w\!\#\$\%\&\'\*\+\-\/\=\?\^\`\{\|\}\~]+@(?:(?:(?:[a-zA-Z0-9](?:[a-zA-Z0-9\-](?!\.)){0,61}[a-zA-Z0-9]?\.)+[a-zA-Z0-9](?:[a-zA-Z0-9\-](?!$)){0,61}[a-zA-Z0-9]?)|(?:\[(?:(?:[01]?\d{1,2}|2[0-4]\d|25[0-5])\.){3}(?:[01]?\d{1,2}|2[0-4]\d|25[0-5])\]))$/,
        password: /^[a-zA-Z\W0-9]{6,20}$/,
        name: /^([\u4e00-\u9fa5]){2,7}$/,    // 人名
        phone: /^(13[0-9]|15[0|1|3|6|7|8|9]|18[8|9])\d{8}$/,  // 手机号
        tel: /0\d{2,3}-\d{5,9}|0\d{2,3}-\d{5,9}/
      },
      msg: {
        username: '请输入11位手机号或者邮箱',
        password: '6-20位字符，可由英文、数字及标点符号组成',
        repeatPassword: '密码不一致',
        name: '请输入中文字符串',
        captcha: '验证码错误',
        phone: '手机号格式错误',
        tel: '固定电话格式错误',
        require: '必填'
      }
    };
  }

})();
